BANIUCZYN/OSCYLOSKOP_STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "app_touchgfx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "../Components/otm8009a/otm8009a.h"
#include "stm32469i_discovery_sdram.h"
#include "stm32469i_discovery_qspi.h"

#include <string.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* DISPLAY */
#define LCD_ORIENTATION_LANDSCAPE 0x01
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

DSI_HandleTypeDef hdsi;

I2C_HandleTypeDef hi2c1;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

TIM_HandleTypeDef htim2;

SDRAM_HandleTypeDef hsdram1;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TouchGFXTask */
osThreadId_t TouchGFXTaskHandle;
const osThreadAttr_t TouchGFXTask_attributes = {
  .name = "TouchGFXTask",
  .stack_size = 4096 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* USER CODE BEGIN PV */
// ===================================================================================

#define DATA_BUFFER_SIZE 10800 //na razie tak, a czy będzie git to sie okaże

uint32_t DATA_buffer[DATA_BUFFER_SIZE];
// uint32_t DATA_buffer_A[DATA_BUFFER_SIZE];
// uint32_t DATA_buffer_B[DATA_BUFFER_SIZE];
uint32_t GUI_buffer[DATA_BUFFER_SIZE];

// uint16_t ch1_adc;
// uint16_t *ch1_adc_ptr = &ch1_adc;
// uint16_t ch2_adc;
// uint16_t *ch2_adc_ptr = &ch2_adc;

volatile uint8_t buffer_ready_flag = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_DSIHOST_DSI_Init(void);
static void MX_FMC_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_I2C1_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_TIM2_Init(void);
void StartDefaultTask(void *argument);
extern void TouchGFX_Task(void *argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  // ===================================================================================

  // *** TIM2
  // --------------------------------------------------
  __HAL_RCC_TIM2_CLK_ENABLE();
  // --------------------------------------------------

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CRC_Init();
  MX_DMA2D_Init();
  MX_DSIHOST_DSI_Init();
  MX_FMC_Init();
  MX_LTDC_Init();
  MX_QUADSPI_Init();
  MX_I2C1_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_TIM2_Init();
  MX_TouchGFX_Init();
  /* Call PreOsInit function */
  MX_TouchGFX_PreOSInit();
  /* USER CODE BEGIN 2 */
  // ===================================================================================

  /*
  // *** KOKNFIGURACJA DMA DOUBLE BUFFERING
  // --------------------------------------------------
  // Profilaktyczne wylaczenie DMA
  __HAL_DMA_DISABLE(hadc1.DMA_Handle);

  // Ustawienie wskaznika bufora A (M0AR)
  hadc1.DMA_Handle->Instance->M0AR = (uint32_t)DATA_buffer_A;

  // Ustawienie wskaznika bufora B (M1AR)
  hadc1.DMA_Handle->Instance->M1AR = (uint32_t)DATA_buffer_B;

  // Właczenie double buffer mode (DBM bit)
  hadc1.DMA_Handle->Instance->CR |= DMA_SxCR_DBM;

  // Ustawienie liczby danych
  hadc1.DMA_Handle->Instance->NDTR = DATA_BUFFER_SIZE;
  */

  // Wlaczenie DMA
  __HAL_DMA_ENABLE(hadc1.DMA_Handle);

  // *** ADC
  // --------------------------------------------------
  HAL_ADC_Start_DMA(&hadc1, (uint32_t *)DATA_buffer, DATA_BUFFER_SIZE);
  // --------------------------------------------------

  /*
  // *** ADC dla DBM
  // --------------------------------------------------
  HAL_ADC_Start_DMA(&hadc1, (uint32_t *)DATA_buffer_A, DATA_BUFFER_SIZE);
  // --------------------------------------------------
   */

  // *** TIM2
  // --------------------------------------------------
  HAL_TIM_Base_Start_IT(&htim2);
  // --------------------------------------------------

  // *** MAIN LOOP
  //---------------------------------------------------
  // while(1)
  // {}

  /* USER CODE END 2 */

